src/randomMatrix/templateCases/cavity/cavity_base-kl/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16
(
(-0.0299977 0.0147754 0)
(-0.0564607 0.00369328 0)
(-0.0537142 -0.0259712 0)
(-0.0335794 -0.0275394 0)
(-0.0370003 0.0586842 0)
(-0.0427099 0.0140779 0)
(-0.0412833 -0.0594006 0)
(-0.0565923 -0.0833176 0)
(0.00920636 0.0422894 0)
(0.0387084 0.0212772 0)
(0.0727206 0.0140991 0)
(0.0134111 -0.0844082 0)
(-0.0022097 0.0904378 0)
(0.0727694 0.0866399 0)
(-0.0635078 0.0913956 0)
(0.308455 -0.0360037 0)
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
