src/randomMatrix/templateCases/cavity/cavity_base-kl/constant/indexH.txt
0  0
1  4
2  8
3  12
