src/randomMatrix/templateCases/cavity/cavity_base-kl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4;
        startFace       24;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       28;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32;
        startFace       40;
    }
)

// ************************************************************************* //
